Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Executando terraform plan


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_autoscaling_group.atlantis_ecs has changed
~ resource "aws_autoscaling_group" "atlantis_ecs" {
        id                        = "atlantis_ecs"
      ~ max_size                  = 2 -> 1
      ~ min_size                  = 0 -> 1
        name                      = "atlantis_ecs"
      ~ target_group_arns         = [
          + "arn:aws:elasticloadbalancing:us-east-2:398963803929:targetgroup/tg-ecs/3efdda83734360cb",
        ]
        # (20 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_autoscaling_group.atlantis_ecs will be updated in-place
~ resource "aws_autoscaling_group" "atlantis_ecs" {
        id                        = "atlantis_ecs"
      ~ max_size                  = 1 -> 2
      ~ min_size                  = 1 -> 0
        name                      = "atlantis_ecs"
      ~ target_group_arns         = [
          - "arn:aws:elasticloadbalancing:us-east-2:398963803929:targetgroup/tg-ecs/3efdda83734360cb",
        ]
        # (20 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_launch_configuration.amazon_linux will be created
+ resource "aws_launch_configuration" "amazon_linux" {
      + arn                         = (known after apply)
      + associate_public_ip_address = false
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + iam_instance_profile        = "ecsInstanceRole"
      + id                          = (known after apply)
      + image_id                    = "ami-00f030d3d7a345389"
      + instance_type               = "t2.micro"
      + key_name                    = "SNS"
      + name                        = "atlantis_ecs_amazon_linux"
      + name_prefix                 = (known after apply)
      + security_groups             = [
          + "sg-0bc41796ed8a952f2",
        ]
      + user_data                   = "8428bcb25ea4644ae5badd4df1cfb7e662176f98"

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://66992d035d8e:4141/lock?id=Matheus-SCosta%252FATLANTIS-ECS%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 1 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
